Revit 2026 API

# BoundingBoxUVIsSet Property

---

Indicates whether the BoundingBoxUV is set or not.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsSet { get; }
```
```vb
Public ReadOnly Property IsSet As Boolean
	Get
```
```cpp
public:
property bool IsSet {
	bool get ();
}
```
```fsharp
member IsSet : bool with get
```

#### Property Value

Boolean

An unset BoundingBoxUV has its lower-left corner to the right of (and above) its upper-right corner (this is an arbitrary internal representation). It means that it is empty and has never been initialized. If someone using the API creates a Plane via one of the Plane.Create() methods, for example, the Plane will not have its envelope set, so Surface.GetBoundingBoxUV() would return an empty BoundingBoxUV.

#### Reference

BoundingBoxUV Class

Autodesk.Revit.DB Namespace